Repository: JirayuJanlert/flutter-mynotes
Catalog: lib/l10n/intl_*.arb
Languages: th

# logout_button
source: Log out
th: ออกจากระบบ

source: Note
th: โน้ต

source: Cancel
th: ยกเลิก

source: Confirm
th: ยืนยัน

source: Delete
th: ลบ

source: Sharing
th: แชร์

# signup_capital
source: SIGNUP
th: ลงทะเบียน

# login_capital
source: LOGIN
th: เข้าสู่ระบบ

source: Login
th: เข้าสู่ระบบ

source: Verify email
th: ยืนยันอีเมล

source: Register
th: ลงทะเบียน

source: Restart
th: รีสตาร์ท

# back_to_login
source: Back to login page
th: กลับสู่หน้าเข้าสู่ระบบ

# welcome_screen_prompt
source: Welcome to Notesy
th: ยินดีต้อนรับสู่ Notesy

source: Start typing your note
th: เริ่มเขียนโน้ต

# delete_note_prompt
source: Are you sure you want to delete this note?
th: คุณแน่ใจหรือไม่ว่าต้องการลบโน้ตนี้

# cannot_share_empty_note_prompt
source: Cannot share an empty note!
th: ไม่สามารถแชร์โน้ตที่ว่างเปล่า!

# generic_error_prompt
source: An error occurred
th: เกิดข้อผิดพลาด

# logout_dialog_prompt
source: Are you sure you want to log out?
th: คุณแน่ใจหรือไม่ว่าต้องการออกจากระบบ

source: Password reset
th: รีเซ็ตรหัสผ่าน

# password_reset_dialog_prompt
source: We have now sent you a password reset link. Please check your email for more information.
th: เราได้ส่งลิงก์รีเซ็ตรหัสผ่านให้คุณแล้ว โปรดตรวจสอบอีเมลของคุณสำหรับข้อมูลเพิ่มเติม

# login_error_cannot_find_user
source: Cannot find a user with the entered credentials!
th: ไม่พบผู้ใช้ที่มีข้อมูลประจำตัวที่ป้อน!

# login_error_wrong_credentials
source: Wrong credentials
th: ข้อมูลประจำตัวไม่ถูกต้อง

# login_error_auth_error
source: Authentication error
th: ข้อผิดพลาดในการตรวจสอบสิทธิ์

# login_view_forgot_password
source: I forgot my password
th: ฉันลืมรหัสผ่าน

# login_view_not_registered_yet
source: Not registered yet? Register here!
th: ยังไม่ได้ลงทะเบียนใช่ไหม ลงทะเบียนที่นี่!

# login_view_remember_me
source: Remember me
th: จำฉัน

# login_view_social_login
source: Social Login
th: หรือ

# login_view_new_user
source: New User?
th: ผู้ใช้ใหม่?

# login_view_sign_up
source: SignUp
th: สมัครสมาชิก

# email_text_field_label
source: Email
th: อีเมล

# email_text_field_placeholder
source: Enter your email here
th: ป้อนอีเมลของคุณที่นี่

# password_text_field_label
source: Password
th: รหัสผ่าน

# password_text_field_placeholder
source: Enter your password here
th: ป้อนรหัสผ่านของคุณที่นี่

# confirm_password_text_field_label
source: Confirm Password
th: ยืนยันรหัสผ่าน

# confirm_password_text_field_placeholder
source: Enter your password again
th: ป้อนรหัสผ่านของคุณอีกครั้ง

source: Forgot Password
th: ลืมรหัสผ่าน

# forgot_password_view_generic_error
source: We could not process your request. Please make sure that you are a registered user, or if not, register a user now by going back one step.
th: เราไม่สามารถดำเนินการตามคำขอของคุณได้ โปรดตรวจสอบว่าคุณเป็นผู้ใช้ที่ลงทะเบียนแล้ว หรือหากไม่ใช่ ให้ลงทะเบียนผู้ใช้ทันทีโดยย้อนกลับไปหนึ่งขั้นตอน

# forgot_password_view_prompt
source: If you forgot your password, simply enter your email and we will send you a password reset link.
th: หากคุณลืมรหัสผ่าน เพียงป้อนอีเมลของคุณ แล้วเราจะส่งลิงก์รีเซ็ตรหัสผ่านให้คุณ

# forgot_password_view_send_me_link
source: Send me password reset link
th: ส่งลิงก์รีเซ็ตรหัสผ่านให้ฉัน

# register_error_weak_password
source: This password is not secure enough. Please choose another password!
th: รหัสผ่านนี้ไม่ปลอดภัยเพียงพอ โปรดเลือกรหัสผ่านอื่น!

# register_error_email_already_in_use
source: This email is already registered to another user. Please choose another email!
th: อีเมลนี้ลงทะเบียนกับผู้ใช้รายอื่นแล้ว โปรดเลือกอีเมลอื่น!

# register_error_generic
source: Failed to register. Please try again later!
th: ลงทะเบียนไม่สำเร็จ โปรดลองอีกครั้งในภายหลัง!

# register_error_invalid_email
source: The email address you entered appears to be invalid. Please try another email address!
th: ที่อยู่อีเมลที่คุณป้อนดูเหมือนจะไม่ถูกต้อง โปรดลองที่อยู่อีเมลอื่น!

# register_view_prompt
source: Create Your account for free!
th: สร้างบัญชีของคุณได้ฟรี!

# register_view_already_registered
source: Already Have an Account?
th: มีบัญชีอยู่แล้ว

# register_view_signup
source: Sign Up
th: ลงทะเบียน

# verify_email_view_prompt
source: A verification email has been sent to your email
th: อีเมลยืนยันถูกส่งไปยังอีเมลของคุณ

# verify_email_resend_email_verification
source: Resend email verification
th: ส่งการยืนยันอีเมลอีกครั้ง

# verify_email_verification_success
source: Email is verified
th: ยืนยันอีเมลแล้ว

# textfield_validation_error_password_unmatched
source: The passwords do not matched
th: รหัสผ่านไม่ตรงกัน

# textfield_validation_error_value_emty
source: Please enter value
th: กรุณาป้อนข้อมูล

# note_view_no_notes
source: No Note
th: ไม่มีโน้ต

# notes_title
source: {count, plural, =0{No notes yet} =1{1 note} other{{count} notes}}
th: {count, plural, =0{ยังไม่มีโน้ต} =1{1 โน้ต} other{{count} โน้ต}}
